# IsPDFImportAvailable Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
OptionalFunctionalityUtils..::..IsPDFImportAvailable Method
OptionalFunctionalityUtils Class See Also
---
Checks whether PDF import is available in the installed Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2020
# Syntax
C#
---
```text
public static bool IsPDFImportAvailable()
```

Visual Basic
---
```text
Public Shared Function IsPDFImportAvailable As Boolean
```

Visual C++
---
```text
public:
static bool IsPDFImportAvailable()
```

# ### Return Value
True if a PDF import is available in the installed Revit.
# Remarks
PDF Import requires the presence of certain modules that are optional and may not be part of the installed Revit.
# See Also
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace